src/DataProcessors/ЖурналДокументовЗакупки/ЖурналДокументовЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be6c7627-3a81-434a-bccf-007a451c8959">
  <name>ЖурналДокументовЗакупки</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЖурналДокументовЗакупки/Forms/СписокДокументов/Module.bsl
&НаСервере
Процедура ДобавитьСписокДокументыЗакупкиПолеСостояниеПоступления()
	
	ТекстЗапроса = СтрЗаменить(ЭтаФорма["СписокДокументыЗакупки"].ТекстЗапроса,  "ВЫБРАТЬ",
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.ПустаяСсылка)  КАК СостояниеПоступления,");
	
	СписокДокументыЗакупки.ТекстЗапроса = ТекстЗапроса;
	
	Если Элементы.Найти("СостояниеПоступления") = Неопределено Тогда 	
		ЭлементФормыСостояниеПоступления = Элементы.Вставить("СостояниеПоступления", 
			Тип("ПолеФормы"), Элементы["СписокДокументыЗакупки"], Элементы["ГруппаОперацияТип"]);
		ЭлементФормыСостояниеПоступления.Вид = ВидПоляФормы.ПолеНадписи;
		ЭлементФормыСостояниеПоступления.ПутьКДанным = "СписокДокументыЗакупки.СостояниеПоступления";
		ЭлементФормыСостояниеПоступления.Видимость = Истина;
		ЭлементФормыСостояниеПоступления.ГиперссылкаЯчейки = Истина;
		ЭлементФормыСостояниеПоступления.Заголовок = "Состояние поступления";
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ax_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьСписокДокументыЗакупкиПолеСостояниеПоступления();	
КонецПроцедуры

&НаСервере
&После("ОтборОперацияТипОбработкаВыбораСервер")
Процедура ax_ОтборОперацияТипОбработкаВыбораСервер(АдресХозяйственныхОперацийИДокументов)
	ДобавитьСписокДокументыЗакупкиПолеСостояниеПоступления();
КонецПроцедуры

&НаКлиенте
Процедура ax_СписокДокументыЗакупкиВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Действие недоступно для строки группировки списка!'"));
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СостояниеОригиналаПервичногоДокумента" Или Поле.Имя = "СостояниеОригиналПолучен" Тогда
		// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
		УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя,ЭтотОбъект,Элементы.СписокДокументыЗакупки, СтандартнаяОбработка);
		// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьЗамерыПроизводительности Тогда
		
		ИмяКлючевойОперацииОткрытияФормы = ПолучитьКлючевуюОперациюОткрытияФормыДокументаПоСсылке(Элемент.ТекущиеДанные.Ссылка);
		Если Не ПустаяСтрока(ИмяКлючевойОперацииОткрытияФормы) Тогда
			ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяКлючевойОперацииОткрытияФормы);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Поле = Элементы.СостояниеПоступления 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СостояниеПоступления) Тогда
		
		Отбор = Новый Структура("Склад, Распоряжение", Элемент.ТекущиеДанные.Склад, Элемент.ТекущиеДанные.Ссылка);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", "СостояниеПриемкиКонтекст");
		ПараметрыФормы.Вставить("КлючВарианта", "СостояниеПриемкиКонтекст");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ОткрытьФорму("Отчет.ТоварыКПоступлению.Форма", ПараметрыФормы, ЭтаФорма);
		
	Иначе 
		ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);	
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	Если Поле = Элементы.СостояниеЭДО Тогда
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(Элемент.ТекущиеДанные.Ссылка, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ax_СписокДокументыЗакупкиПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	
	ДокументыПоступления = Новый Массив;
	СоответствиеДокументПоступленияКлючЗаписи = Новый Соответствие;
	
	МассивКлючейЗаписиРеестрДокументов = Строки.ПолучитьКлючи();
	
	Для Каждого КлючЗаписиРеестрДокументов Из МассивКлючейЗаписиРеестрДокументов Цикл 
		ДокументыПоступления.Добавить(КлючЗаписиРеестрДокументов.Ссылка);
		СоответствиеДокументПоступленияКлючЗаписи.Вставить(КлючЗаписиРеестрДокументов.Ссылка, КлючЗаписиРеестрДокументов);
	КонецЦикла;
	
	Если ДокументыПоступления.Количество() > 0 
		И НЕ Строки[МассивКлючейЗаписиРеестрДокументов[0]].Данные.Свойство("СостояниеПоступления") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТоварыКПоступлениюОстаткиТекущие.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстаткиТекущие.Отправитель КАК Отправитель,
	|	ТоварыКПоступлениюОстаткиТекущие.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиТекущие.Склад КАК Склад,
	|	ТоварыКПоступлениюОстаткиТекущие.КОформлениюОрдеровОстаток КАК КОформлениюОрдеровОстаток,
	|	ТоварыКПоступлениюОстаткиТекущие.КОформлениюПоступленийПоОрдерамОстаток КАК КОформлениюПоступленийПоОрдерамОстаток,
	|	ТоварыКПоступлениюОстаткиТекущие.ПринимаетсяОстаток КАК ПринимаетсяОстаток
	|ПОМЕСТИТЬ ТоварыКПоступлениюОстаткиТекущие
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления В (&ДокументыПоступления)) КАК ТоварыКПоступлениюОстаткиТекущие
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад,
	|	ДокументПоступления,
	|	Отправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлениюОрдеровОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюОрдеровОбороты.Склад КАК Склад,
	|	ТоварыКОформлениюОрдеровОбороты.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКОформлениюОрдеровОбороты.Отправитель КАК Отправитель,
	|	ТоварыКОформлениюОрдеровОбороты.КОформлениюОрдеровОборот КАК КОформлениюОрдеровОборот,
	|	ТоварыКОформлениюОрдеровОбороты.КОформлениюОрдеровПриход КАК КОформлениюОрдеровПриход,
	|	ТоварыКОформлениюОрдеровОбороты.КОформлениюОрдеровРасход КАК КОформлениюОрдеровРасход,
	|	ТоварыКОформлениюОрдеровОбороты.ПринимаетсяОборот КАК ПринимаетсяОборот,
	|	ТоварыКОформлениюОрдеровОбороты.ПринимаетсяПриход КАК ПринимаетсяПриход,
	|	ТоварыКОформлениюОрдеровОбороты.ПринимаетсяРасход КАК ПринимаетсяРасход
	|ПОМЕСТИТЬ ТоварыКОформлениюОрдеровОбороты
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Обороты(, , , ДокументПоступления В (&ДокументыПоступления)) КАК ТоварыКОформлениюОрдеровОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад,
	|	ДокументПоступления,
	|	Отправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад КАК Склад,
	|	СУММА(ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровОстаток) КАК КОформлениюОрдеровОстаток,
	|	МАКСИМУМ(ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерамОстаток) КАК КОформлениюПоступленийПоОрдерамОстаток,
	|	СУММА(ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяОстаток) КАК ПринимаетсяОстаток
	|ПОМЕСТИТЬ ТоварыКПоступлениюОстаткиНаДату
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(
	|			,
	|			(Номенклатура, Склад, ДокументПоступления, Отправитель) В
	|				(ВЫБРАТЬ
	|					ФильтрТоваровКПоступлению.Номенклатура,
	|					ФильтрТоваровКПоступлению.Склад,
	|					ФильтрТоваровКПоступлению.ДокументПоступления,
	|					ФильтрТоваровКПоступлению.Отправитель
	|				ИЗ
	|					ТоварыКПоступлениюОстаткиТекущие КАК ФильтрТоваровКПоступлению)) КАК ТоварыКПоступлениюОстаткиНаДату
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад,
	|	ДокументПоступления,
	|	Отправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяОстаток > 0
	|			ТОГДА 1
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровОстаток > 0
	|				И ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяОстаток = 0
	|			ТОГДА 2
	|		КОГДА ТоварыКПоступлениюОстаткиТекущие.КОформлениюОрдеровОстаток < 0
	|				И ТоварыКПоступлениюОстаткиТекущие.ПринимаетсяОстаток = 0
	|			ТОГДА 3
	|		КОГДА ЕСТЬNULL(ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерамОстаток, 0) <> 0
	|			ТОГДА 4
	|		КОГДА ЛОЖЬ
	|			ТОГДА 6
	|		ИНАЧЕ 404
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ втВложенныйЗапрос
	|ИЗ
	|	ТоварыКПоступлениюОстаткиНаДату КАК ТоварыКПоступлениюОстаткиНаДату
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКПоступлениюОстаткиТекущие КАК ТоварыКПоступлениюОстаткиТекущие
	|		ПО ТоварыКПоступлениюОстаткиНаДату.Номенклатура = ТоварыКПоступлениюОстаткиТекущие.Номенклатура
	|			И ТоварыКПоступлениюОстаткиНаДату.Отправитель = ТоварыКПоступлениюОстаткиТекущие.Отправитель
	|			И ТоварыКПоступлениюОстаткиНаДату.Склад = ТоварыКПоступлениюОстаткиТекущие.Склад
	|			И ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления = ТоварыКПоступлениюОстаткиТекущие.ДокументПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКОформлениюОрдеровОбороты КАК ТоварыКОформлениюОрдеровОбороты
	|		ПО ТоварыКПоступлениюОстаткиНаДату.Номенклатура = ТоварыКОформлениюОрдеровОбороты.Номенклатура
	|			И ТоварыКПоступлениюОстаткиНаДату.Отправитель = ТоварыКОформлениюОрдеровОбороты.Отправитель
	|			И ТоварыКПоступлениюОстаткиНаДату.Склад = ТоварыКОформлениюОрдеровОбороты.Склад
	|			И ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления = ТоварыКОформлениюОрдеровОбороты.ДокументПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Партнер,
	|	5
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.ПоДоговорамБезЗаказовИНакладных)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
	|	ВложенныйЗапрос.Отправитель КАК Отправитель,
	|	МИНИМУМ(ВложенныйЗапрос.Состояние) КАК Состояние,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.ВПроцессеПриемки)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.ОжидаетсяПриемка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.Перепоставка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 4
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияПоступленияТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК СостояниеПоступления
	|ИЗ
	|	втВложенныйЗапрос КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Распоряжение,
	|	ВложенныйЗапрос.Отправитель";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументыПоступления", ДокументыПоступления);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаСписка = Строки[СоответствиеДокументПоступленияКлючЗаписи[Выборка.Распоряжение]];
		СтрокаСписка.Данные["СостояниеПоступления"] = Выборка.СостояниеПоступления;	
		
		Если Выборка.СостояниеПоступления = Перечисления.СостоянияПоступленияТоваров.ВПроцессеПриемки  Тогда
			СтрокаСписка.Оформление["СостояниеПоступления"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
		Иначе 
			СтрокаСписка.Оформление["СостояниеПоступления"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
